Revit 2026 API

# LoadCombinationCreate(Document, String) Method

---

Creates a new default LoadCombination.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LoadCombination Create(
	Document document,
	string name
)
```
```vb
Public Shared Function Create (
	document As Document,
	name As String
) As LoadCombination
```
```cpp
public:
static LoadCombination^ Create(
	Document^ document,
	String^ name
)
```
```fsharp
static member Create :
        document : Document *
        name : string -> LoadCombination
```

#### Parameters

document Document
     The Document to which new load combination element will be added.
name String
     The name of the load combination.

#### Return Value

LoadCombination The newly created load combination element if successful,  otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | The given name is not unique |
| ArgumentNullException | A non-optional argument was null |

#### Reference

LoadCombination Class

Create Overload

Autodesk.Revit.DB.Structure Namespace